spec/cassettes/StripeWrapper_Charge/with_invalid_credit_card/contains_an_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=1&card[exp_year]=2020&card[cvc]=191
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.0
      Authorization:
      - Bearer sk_test_QvQjNczvJ1wKiAfbRt3GmPQT
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Michaels-iMac.local 14.1.0 Darwin Kernel Version 14.1.0: Mon Dec 22 23:10:38
        PST 2014; root:xnu-2782.10.72~2/RELEASE_X86_64 x86_64","hostname":"Michaels-iMac.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Sep 2015 20:44:11 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_71HD5p4uTSAAVn
      Stripe-Version:
      - '2015-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16nEfPBxALhWw4ciYINJPhuV",
          "livemode": false,
          "created": 1442781851,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16nEfPBxALhWw4ciZ22mX4uR",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 1,
            "exp_year": 2020,
            "fingerprint": "huqVcNiZhZ4P0H68",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "24.185.234.30"
        }
    http_version: 
  recorded_at: Sun, 20 Sep 2015 20:44:11 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&card=tok_16nEfPBxALhWw4ciYINJPhuV
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.0
      Authorization:
      - Bearer sk_test_QvQjNczvJ1wKiAfbRt3GmPQT
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Michaels-iMac.local 14.1.0 Darwin Kernel Version 14.1.0: Mon Dec 22 23:10:38
        PST 2014; root:xnu-2782.10.72~2/RELEASE_X86_64 x86_64","hostname":"Michaels-iMac.local"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Sep 2015 20:44:12 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_71HDM7qyGuBwq0
      Stripe-Version:
      - '2015-09-08'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_16nEfQBxALhWw4ciArCTmZjH"
          }
        }
    http_version: 
  recorded_at: Sun, 20 Sep 2015 20:44:12 GMT
recorded_with: VCR 2.9.3
